; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-7-50)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	package41 - package
	package42 - package
	package43 - package
	package44 - package
	package45 - package
	package46 - package
	package47 - package
	package48 - package
	package49 - package
	package50 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p0-1 - location
	p0-2 - location
	p1-0 - location
	p2-0 - location
	p2-3 - location
	p3-0 - location
	p3-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s3)
	(at driver3 s2)
	(at driver4 s1)
	(at driver5 s0)
	(at driver6 s0)
	(at driver7 s1)
	(at driver8 s0)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at truck7 s1)
	(empty truck7)
	(at package1 s2)
	(at package2 s0)
	(at package3 s2)
	(at package4 s0)
	(at package5 s0)
	(at package6 s0)
	(at package7 s2)
	(at package8 s1)
	(at package9 s1)
	(at package10 s1)
	(at package11 s1)
	(at package12 s2)
	(at package13 s2)
	(at package14 s1)
	(at package15 s2)
	(at package16 s0)
	(at package17 s1)
	(at package18 s2)
	(at package19 s0)
	(at package20 s1)
	(at package21 s2)
	(at package22 s2)
	(at package23 s3)
	(at package24 s3)
	(at package25 s3)
	(at package26 s2)
	(at package27 s1)
	(at package28 s1)
	(at package29 s1)
	(at package30 s2)
	(at package31 s0)
	(at package32 s3)
	(at package33 s2)
	(at package34 s0)
	(at package35 s1)
	(at package36 s2)
	(at package37 s0)
	(at package38 s1)
	(at package39 s2)
	(at package40 s3)
	(at package41 s1)
	(at package42 s1)
	(at package43 s3)
	(at package44 s0)
	(at package45 s2)
	(at package46 s3)
	(at package47 s0)
	(at package48 s1)
	(at package49 s2)
	(at package50 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(link s0 s2)
	(link s2 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s3 s1)
	(link s1 s3)
	(link s3 s2)
	(link s2 s3)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s0)
	(at driver4 s3)
	(at driver6 s0)
	(at driver7 s3)
	(at driver8 s2)
	(at truck1 s2)
	(at truck3 s3)
	(at truck4 s3)
	(at truck5 s1)
	(at truck6 s2)
	(at package1 s3)
	(at package3 s2)
	(at package4 s0)
	(at package5 s2)
	(at package6 s0)
	(at package7 s0)
	(at package8 s0)
	(at package9 s0)
	(at package10 s1)
	(at package12 s0)
	(at package13 s3)
	(at package14 s3)
	(at package15 s3)
	(at package16 s0)
	(at package18 s1)
	(at package19 s3)
	(at package20 s0)
	(at package21 s2)
	(at package22 s1)
	(at package23 s3)
	(at package24 s0)
	(at package25 s3)
	(at package26 s3)
	(at package27 s0)
	(at package28 s3)
	(at package29 s3)
	(at package30 s1)
	(at package31 s3)
	(at package32 s1)
	(at package33 s0)
	(at package34 s3)
	(at package35 s3)
	(at package36 s1)
	(at package37 s2)
	(at package38 s3)
	(at package40 s3)
	(at package41 s0)
	(at package42 s3)
	(at package43 s2)
	(at package44 s2)
	(at package45 s0)
	(at package46 s3)
	(at package47 s3)
	(at package48 s0)
	(at package49 s3)
	(at package50 s3)
	))


)

; plan
1. (board-truck driver4 s1 truck2)
   deleted: (at driver4 s1) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 12 of 58
2. (load-truck s1 package9 truck2)
   deleted: (at package9 s1)
   added: (in package9 truck2)
   goals met: 12 of 58
3. (load-truck s1 package8 truck2)
   deleted: (at package8 s1)
   added: (in package8 truck2)
   goals met: 12 of 58
4. (load-truck s1 package48 truck2)
   deleted: (at package48 s1)
   added: (in package48 truck2)
   goals met: 12 of 58
5. (load-truck s1 package42 truck2)
   deleted: (at package42 s1)
   added: (in package42 truck2)
   goals met: 12 of 58
6. (load-truck s1 package41 truck2)
   deleted: (at package41 s1)
   added: (in package41 truck2)
   goals met: 12 of 58
7. (drive-truck driver4 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 12 of 58
8. (drive-truck driver4 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 12 of 58
9. (load-truck s2 package7 truck2)
   deleted: (at package7 s2)
   added: (in package7 truck2)
   goals met: 12 of 58
10. (load-truck s2 package50 truck2)
   deleted: (at package50 s2)
   added: (in package50 truck2)
   goals met: 12 of 58
11. (load-truck s2 package49 truck2)
   deleted: (at package49 s2)
   added: (in package49 truck2)
   goals met: 12 of 58
12. (load-truck s2 package45 truck2)
   deleted: (at package45 s2)
   added: (in package45 truck2)
   goals met: 12 of 58
13. (load-truck s2 package36 truck2)
   deleted: (at package36 s2)
   added: (in package36 truck2)
   goals met: 12 of 58
14. (load-truck s2 package33 truck2)
   deleted: (at package33 s2)
   added: (in package33 truck2)
   goals met: 12 of 58
15. (drive-truck driver4 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 12 of 58
16. (unload-truck s0 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s0)
   goals met: 13 of 58
17. (unload-truck s0 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s0)
   goals met: 14 of 58
18. (unload-truck s0 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s0)
   goals met: 15 of 58
19. (drive-truck driver4 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 15 of 58
20. (load-truck s1 package38 truck2)
   deleted: (at package38 s1)
   added: (in package38 truck2)
   goals met: 15 of 58
21. (unload-truck s1 package36 truck2)
   deleted: (in package36 truck2)
   added: (at package36 s1)
   goals met: 16 of 58
22. (load-truck s1 package35 truck2)
   deleted: (at package35 s1)
   added: (in package35 truck2)
   goals met: 16 of 58
23. (load-truck s1 package29 truck2)
   deleted: (at package29 s1)
   added: (in package29 truck2)
   goals met: 16 of 58
24. (drive-truck driver4 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 16 of 58
25. (drive-truck driver4 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 16 of 58
26. (load-truck s2 package30 truck2)
   deleted: (at package30 s2)
   added: (in package30 truck2)
   goals met: 16 of 58
27. (load-truck s2 package26 truck2)
   deleted: (at package26 s2)
   added: (in package26 truck2)
   goals met: 16 of 58
28. (drive-truck driver4 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 16 of 58
29. (unload-truck s3 package50 truck2)
   deleted: (in package50 truck2)
   added: (at package50 s3)
   goals met: 17 of 58
30. (unload-truck s3 package49 truck2)
   deleted: (in package49 truck2)
   added: (at package49 s3)
   goals met: 18 of 58
31. (drive-truck driver4 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 18 of 58
32. (load-truck s2 package22 truck2)
   deleted: (at package22 s2)
   added: (in package22 truck2)
   goals met: 18 of 58
33. (drive-truck driver4 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 18 of 58
34. (unload-truck s1 package30 truck2)
   deleted: (in package30 truck2)
   added: (at package30 s1)
   goals met: 19 of 58
35. (load-truck s1 package28 truck2)
   deleted: (at package28 s1)
   added: (in package28 truck2)
   goals met: 19 of 58
36. (drive-truck driver4 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 19 of 58
37. (load-truck s3 package43 truck2)
   deleted: (at package43 s3)
   added: (in package43 truck2)
   goals met: 19 of 58
38. (drive-truck driver4 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 19 of 58
39. (unload-truck s2 package43 truck2)
   deleted: (in package43 truck2)
   added: (at package43 s2)
   goals met: 20 of 58
40. (load-truck s2 package18 truck2)
   deleted: (at package18 s2)
   added: (in package18 truck2)
   goals met: 20 of 58
41. (drive-truck driver4 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 20 of 58
42. (load-truck s1 package27 truck2)
   deleted: (at package27 s1)
   added: (in package27 truck2)
   goals met: 20 of 58
43. (drive-truck driver4 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 20 of 58
44. (load-truck s0 package5 truck2)
   deleted: (at package5 s0)
   added: (in package5 truck2)
   goals met: 20 of 58
45. (drive-truck driver4 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 20 of 58
46. (unload-truck s2 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s2)
   goals met: 21 of 58
47. (load-truck s2 package15 truck2)
   deleted: (at package15 s2)
   added: (in package15 truck2)
   goals met: 21 of 58
48. (drive-truck driver4 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 21 of 58
49. (drive-truck driver4 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 21 of 58
50. (unload-truck s3 package42 truck2)
   deleted: (in package42 truck2)
   added: (at package42 s3)
   goals met: 22 of 58
51. (unload-truck s3 package38 truck2)
   deleted: (in package38 truck2)
   added: (at package38 s3)
   goals met: 23 of 58
52. (drive-truck driver4 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 23 of 58
53. (drive-truck driver4 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 23 of 58
54. (unload-truck s0 package48 truck2)
   deleted: (in package48 truck2)
   added: (at package48 s0)
   goals met: 24 of 58
55. (load-truck s0 package47 truck2)
   deleted: (at package47 s0)
   added: (in package47 truck2)
   goals met: 24 of 58
56. (drive-truck driver4 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 24 of 58
57. (drive-truck driver4 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 24 of 58
58. (unload-truck s3 package47 truck2)
   deleted: (in package47 truck2)
   added: (at package47 s3)
   goals met: 25 of 58
59. (unload-truck s3 package35 truck2)
   deleted: (in package35 truck2)
   added: (at package35 s3)
   goals met: 26 of 58
60. (drive-truck driver4 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 26 of 58
61. (unload-truck s1 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s1)
   goals met: 27 of 58
62. (drive-truck driver4 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 27 of 58
63. (unload-truck s0 package45 truck2)
   deleted: (in package45 truck2)
   added: (at package45 s0)
   goals met: 28 of 58
64. (load-truck s0 package44 truck2)
   deleted: (at package44 s0)
   added: (in package44 truck2)
   goals met: 28 of 58
65. (drive-truck driver4 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 28 of 58
66. (drive-truck driver4 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 28 of 58
67. (unload-truck s2 package44 truck2)
   deleted: (in package44 truck2)
   added: (at package44 s2)
   goals met: 29 of 58
68. (drive-truck driver4 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 29 of 58
69. (load-truck s3 package32 truck2)
   deleted: (at package32 s3)
   added: (in package32 truck2)
   goals met: 29 of 58
70. (drive-truck driver4 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 29 of 58
71. (unload-truck s1 package32 truck2)
   deleted: (in package32 truck2)
   added: (at package32 s1)
   goals met: 30 of 58
72. (load-truck s1 package20 truck2)
   deleted: (at package20 s1)
   added: (in package20 truck2)
   goals met: 30 of 58
73. (drive-truck driver4 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 30 of 58
74. (unload-truck s0 package41 truck2)
   deleted: (in package41 truck2)
   added: (at package41 s0)
   goals met: 31 of 58
75. (drive-truck driver4 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 31 of 58
76. (load-truck s2 package13 truck2)
   deleted: (at package13 s2)
   added: (in package13 truck2)
   goals met: 31 of 58
77. (drive-truck driver4 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 31 of 58
78. (unload-truck s3 package29 truck2)
   deleted: (in package29 truck2)
   added: (at package29 s3)
   goals met: 32 of 58
79. (unload-truck s3 package28 truck2)
   deleted: (in package28 truck2)
   added: (at package28 s3)
   goals met: 33 of 58
80. (unload-truck s3 package26 truck2)
   deleted: (in package26 truck2)
   added: (at package26 s3)
   goals met: 34 of 58
81. (drive-truck driver4 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 34 of 58
82. (drive-truck driver4 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 34 of 58
83. (load-truck s0 package37 truck2)
   deleted: (at package37 s0)
   added: (in package37 truck2)
   goals met: 34 of 58
84. (load-truck s0 package34 truck2)
   deleted: (at package34 s0)
   added: (in package34 truck2)
   goals met: 34 of 58
85. (drive-truck driver4 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 34 of 58
86. (drive-truck driver4 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 34 of 58
87. (unload-truck s2 package37 truck2)
   deleted: (in package37 truck2)
   added: (at package37 s2)
   goals met: 35 of 58
88. (load-truck s2 package12 truck2)
   deleted: (at package12 s2)
   added: (in package12 truck2)
   goals met: 35 of 58
89. (drive-truck driver4 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 35 of 58
90. (unload-truck s0 package33 truck2)
   deleted: (in package33 truck2)
   added: (at package33 s0)
   goals met: 36 of 58
91. (drive-truck driver4 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 36 of 58
92. (unload-truck s1 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s1)
   goals met: 37 of 58
93. (drive-truck driver4 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 37 of 58
94. (unload-truck s3 package34 truck2)
   deleted: (in package34 truck2)
   added: (at package34 s3)
   goals met: 38 of 58
95. (load-truck s3 package24 truck2)
   deleted: (at package24 s3)
   added: (in package24 truck2)
   goals met: 38 of 58
96. (drive-truck driver4 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 38 of 58
97. (drive-truck driver4 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 38 of 58
98. (load-truck s0 package31 truck2)
   deleted: (at package31 s0)
   added: (in package31 truck2)
   goals met: 38 of 58
99. (unload-truck s0 package27 truck2)
   deleted: (in package27 truck2)
   added: (at package27 s0)
   goals met: 39 of 58
100. (drive-truck driver4 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 39 of 58
101. (load-truck s2 package1 truck2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 39 of 58
102. (drive-truck driver4 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 39 of 58
103. (unload-truck s3 package31 truck2)
   deleted: (in package31 truck2)
   added: (at package31 s3)
   goals met: 40 of 58
104. (unload-truck s3 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s3)
   goals met: 41 of 58
105. (unload-truck s3 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s3)
   goals met: 42 of 58
106. (drive-truck driver4 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 42 of 58
107. (drive-truck driver4 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 42 of 58
108. (unload-truck s0 package24 truck2)
   deleted: (in package24 truck2)
   added: (at package24 s0)
   goals met: 43 of 58
109. (unload-truck s0 package20 truck2)
   deleted: (in package20 truck2)
   added: (at package20 s0)
   goals met: 44 of 58
110. (load-truck s0 package19 truck2)
   deleted: (at package19 s0)
   added: (in package19 truck2)
   goals met: 44 of 58
111. (drive-truck driver4 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 44 of 58
112. (drive-truck driver4 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 44 of 58
113. (unload-truck s3 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s3)
   goals met: 45 of 58
114. (unload-truck s3 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   goals met: 46 of 58
115. (board-truck driver7 s1 truck3)
   deleted: (at driver7 s1) (empty truck3)
   added: (driving driver7 truck3)
   goals met: 46 of 58
116. (board-truck driver8 s0 truck4)
   deleted: (at driver8 s0) (empty truck4)
   added: (driving driver8 truck4)
   goals met: 46 of 58
117. (drive-truck driver7 s1 s3 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   goals met: 47 of 58
118. (disembark-truck driver7 s3 truck3)
   deleted: (driving driver7 truck3)
   added: (at driver7 s3) (empty truck3)
   goals met: 48 of 58
119. (board-truck driver2 s3 truck5)
   deleted: (at driver2 s3) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 48 of 58
120. (drive-truck driver8 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 48 of 58
121. (load-truck s1 package14 truck4)
   deleted: (at package14 s1)
   added: (in package14 truck4)
   goals met: 48 of 58
122. (drive-truck driver8 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 48 of 58
123. (drive-truck driver8 s2 s3 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   goals met: 49 of 58
124. (unload-truck s3 package14 truck4)
   deleted: (in package14 truck4)
   added: (at package14 s3)
   goals met: 50 of 58
125. (drive-truck driver2 s3 s1 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s1)
   goals met: 51 of 58
126. (disembark-truck driver2 s1 truck5)
   deleted: (driving driver2 truck5)
   added: (at driver2 s1) (empty truck5)
   goals met: 52 of 58
127. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   goals met: 52 of 58
128. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   goals met: 53 of 58
129. (drive-truck driver4 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 53 of 58
130. (drive-truck driver4 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 53 of 58
131. (unload-truck s0 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s0)
   goals met: 54 of 58
132. (disembark-truck driver4 s0 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 54 of 58
133. (walk driver4 s0 p3-0)
   deleted: (at driver4 s0)
   added: (at driver4 p3-0)
   goals met: 54 of 58
134. (walk driver4 p3-0 s3)
   deleted: (at driver4 p3-0)
   added: (at driver4 s3)
   goals met: 55 of 58
135. (board-truck driver7 s3 truck6)
   deleted: (at driver7 s3) (empty truck6)
   added: (driving driver7 truck6)
   goals met: 54 of 58
136. (drive-truck driver8 s3 s2 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   goals met: 53 of 58
137. (disembark-truck driver8 s2 truck4)
   deleted: (driving driver8 truck4)
   added: (at driver8 s2) (empty truck4)
   goals met: 54 of 58
138. (drive-truck driver7 s3 s2 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   goals met: 55 of 58
139. (board-truck driver3 s2 truck4)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 55 of 58
140. (drive-truck driver3 s2 s3 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   goals met: 56 of 58
141. (drive-truck driver7 s2 s3 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s3)
   goals met: 55 of 58
142. (disembark-truck driver3 s3 truck4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s3) (empty truck4)
   goals met: 55 of 58
143. (walk driver3 s3 p3-0)
   deleted: (at driver3 s3)
   added: (at driver3 p3-0)
   goals met: 55 of 58
144. (walk driver3 p3-0 s0)
   deleted: (at driver3 p3-0)
   added: (at driver3 s0)
   goals met: 56 of 58
145. (drive-truck driver7 s3 s2 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   goals met: 57 of 58
146. (disembark-truck driver7 s2 truck6)
   deleted: (driving driver7 truck6)
   added: (at driver7 s2) (empty truck6)
   goals met: 57 of 58
147. (walk driver7 s2 p2-3)
   deleted: (at driver7 s2)
   added: (at driver7 p2-3)
   goals met: 57 of 58
148. (walk driver7 p2-3 s3)
   deleted: (at driver7 p2-3)
   added: (at driver7 s3)
   goals met: 58 of 58
